Public Member Functions | Public Attributes | List of all members
DG::AppearanceChangedEventArg Class Reference
Dialog Manager
Event argument for appearance change notifications. More...
#include <DGAppearanceManager.hpp>
 Inheritance diagram for DG::AppearanceChangedEventArg:
 Public Member Functions
AppearanceChangedEventArg (AppearanceMode mode, AppearanceType type)
Constructor for AppearanceChangedEventArg.
 virtual  | ~AppearanceChangedEventArg ()
Destructor for AppearanceChangedEventArg.
 Public Attributes
 AppearanceMode  | mode
The current appearance mode.
 AppearanceType  | type
The current appearance type.
Detailed Description
Event argument for appearance change notifications.
Constructor & Destructor Documentation
◆ AppearanceChangedEventArg()
 DG::AppearanceChangedEventArg::AppearanceChangedEventArg  |  ( |  AppearanceMode |  mode,
|  AppearanceType |  type )
Constructor for AppearanceChangedEventArg.
Parameters
mode | The appearance mode.
type | The appearance type.